2024-fall/Engineering as a Christian Vocation.tex
% Created 2024-08-18 Sun 14:04
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[left=0.75in, right=0.75in, top=0.75in, bottom=0.75in]{geometry}
\usepackage{biblatex}
\addbibresource{~/org/biblio.bib}
\usepackage{mdframed}
\usepackage{titlesec}
\titleformat{\section}[block]{\Large\bfseries\filcenter}{}{1em}{}
\let\oldsection\section
\renewcommand\section{\clearpage\oldsection}
\usepackage{mlmodern}
\date{}
\title{Engineering as a Christian Vocation\\\medskip
\large Fall 2024}
\hypersetup{
 pdfauthor={},
 pdftitle={Engineering as a Christian Vocation},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.4 (Org mode 9.8)}, 
 pdflang={English}}
\begin{document}

\maketitle
\section*{Introduction}
\label{sec:org2ea11a5}
\begin{center}
\textbf{Faith and Vocation as Practitioners of Engineering, Computer Science, and
 Technology}
\end{center}

\emph{``Whether you are a student or a seasoned professional, many Christians working
in technical areas struggle with engaging their faith in the world of
technology. Perhaps you never thought about how your faith might inform your
work in technology. Perhaps you feel a disconnect between your daily
professional life and your Christian spiritual walk. The development of
technology through science and engineering has always been a cultural activity
with religious implications, but its direction is set by the human heart.
Developing and using technology is one way we love God and our neighbor, and
more fully witness to the gospel of Jesus Christ for the entire world.''}
\begin{flushright}
From \emph{A Christian Field Guide to Technology for Engineers and Designers} by
Ethan Brue, Derek Schuurman, and Steven Vanderleest
\end{flushright}

The primary question driving this discussion group is, \emph{What is the role of a
Christian in a technological vocation?} Modernity seems to be telling us that
science, technology, and engineering are somehow opposed to faith. Furthermore,
to many, the influence of technology and ``science'' are the primary reasons for
abandoning their faith. However, many feel called to engage with technology, not
simply as an end user, but a creator, practitioner, designer, and engineer.
\section*{Schedule Overview}
\label{sec:org27c7bbb}
\subsection*{Week 1}
\label{sec:orgfa35e05}
\textbf{\uline{Subject: The Technological Frame}}

\begin{mdframed}
\emph{“Therefore everyone who hears these words of mine and puts them into practice
is like a wise man who built his house on the rock. The rain came down, the
streams rose, and the winds blew and beat against that house; yet it did not
fall, because it had its foundation on the rock. But everyone who hears these
words of mine and does not put them into practice is like a foolish man who
built his house on sand. The rain came down, the streams rose, and the winds
blew and beat against that house, and it fell with a great crash.”} Matthew
7:24-27
\end{mdframed}

Can we build our understanding of the technological vocation on rock?
\subsubsection*{Readings}
\label{sec:orgc15d435}
\begin{itemize}
\item \emph{What Frames What?} by Richard Horner \emph{Reconsiderations} Vol 4, \#5 October
2005
\item \emph{Five Things We Need to Know About Technological Change} by Neil Postman,
Lecture Given in March 1998
\end{itemize}
\subsection*{Week 2}
\label{sec:org1dcb2e2}
\textbf{\uline{Subject: A Secular Framing of Ethical Technology}}

\begin{mdframed}
\emph{``Do not love the world or anything in the world. If anyone loves the world,
love for the Father is not in them. For everything in the world—the lust
of the flesh, the lust of the eyes, and the pride of life—comes not from the
Father but from the world. The world and its desires pass away, but whoever
does the will of God lives forever.''} 1 John 2:15-17
\end{mdframed}
\subsubsection*{Readings}
\label{sec:org4796ec5}
\begin{itemize}
\item \emph{Ethics in the Age of Disruptive Technology, Appendix 1/2 - Examples of
Technology Ethics and Responsible Technology Practices \& ITEC Principles and
How to Use Them: Anchoring, Guiding, Specifying, Action} by Intstitute for
Technology, Ethics, and Culture
\item \emph{Ethics in Technology Practice} by Shannon Vallorm, Iring Raicu, and Brian
Green. The Markkula Center for Applied Ethics at Santa Clara University
\item \emph{Code of Ethics for Engineers} National Society of Professional Engineers
\end{itemize}
\subsection*{Week 3}
\label{sec:org5fa1029}
\textbf{\uline{Subject: A Christian Framing of Ethical Technology}}
\begin{mdframed}
\emph{``Do not conform to the pattern of this world, but be transformed by the
renewing of your mind. Then you will be able to test and approve what God’s will
is—his good, pleasing and perfect will.''} Romans 12:2 \newline
\noindent \emph{``Your hands made me and formed me; give me understanding to
learn your commands.''} Psalm 119:73
\end{mdframed}
\subsubsection*{Readings}
\label{sec:org5e58e18}
\begin{itemize}
\item \emph{The Computer Scientist as Toolsmith II} by Fred Brooks, Communications with
the ACM, March 1996
\item \emph{A Christian Field Guide to Technology for Engineers and Designers}, Chapters
5 \& 6, by Ethan Brue, Derek Schuurman, and Steven Vanderleest
\end{itemize}
\subsection*{Week 4}
\label{sec:orgdbcd8b3}
\textbf{\uline{Subject: Putting it Into Practice}}
\begin{mdframed}
\emph{``Whatever you do, work at it with all your heart, as working for the Lord, not
for human masters, since you know that you will receive an inheritance from the
Lord as a reward. It is the Lord Christ you are serving.''} Colossians 3:23-24
\end{mdframed}
\subsubsection*{Readings}
\label{sec:orge63fab9}
\begin{itemize}
\item \emph{A Christian Field Guide to Technology for Engineers and Designers}, Chapter
9, by Ethan Brue, Derek Schuurman, and Steven Vanderleest
\end{itemize}
\section*{Week 1}
\label{sec:orgfe79a96}
\subsection*{Readings}
\label{sec:org95ab3fc}
\subsection*{Discussion Topics}
\label{sec:org3a806d9}
\end{document}
