2024-fall/Engineering as a Christian Vocation.md



# Introduction

<div class="org-center">
<p>
<b>Faith and Vocation as Practitioners of Engineering, Computer Science, and
 Technology</b>
</p>
</div>

*&ldquo;Whether you are a student or a seasoned professional, many Christians working
in technical areas struggle with engaging their faith in the world of
technology. Perhaps you never thought about how your faith might inform your
work in technology. Perhaps you feel a disconnect between your daily
professional life and your Christian spiritual walk. The development of
technology through science and engineering has always been a cultural activity
with religious implications, but its direction is set by the human heart.
Developing and using technology is one way we love God and our neighbor, and
more fully witness to the gospel of Jesus Christ for the entire world.&rdquo;*

<div class="flushright" id="org7e43671">
<p>
From <i>A Christian Field Guide to Technology for Engineers and Designers</i> by
Ethan Brue, Derek Schuurman, and Steven Vanderleest
</p>

</div>

The primary question driving this discussion group is, *What is the role of a
Christian in a technological vocation?* Modernity seems to be telling us that
science, technology, and engineering are somehow opposed to faith. Furthermore,
to many, the influence of technology and &ldquo;science&rdquo; are the primary reasons for
abandoning their faith. However, many feel called to engage with technology, not
simply as an end user, but a creator, practitioner, designer, and engineer.


# Schedule Overview


## Week 1

**<span class="underline">Subject: The Technological Frame</span>**

<div class="mdframed" id="org8d9b583">
<p>
<i>“Therefore everyone who hears these words of mine and puts them into practice
is like a wise man who built his house on the rock. The rain came down, the
streams rose, and the winds blew and beat against that house; yet it did not
fall, because it had its foundation on the rock. But everyone who hears these
words of mine and does not put them into practice is like a foolish man who
built his house on sand. The rain came down, the streams rose, and the winds
blew and beat against that house, and it fell with a great crash.”</i> Matthew
7:24-27
</p>

</div>

Can we build our understanding of the technological vocation on rock?


### Readings

-   *What Frames What?* by Richard Horner *Reconsiderations* Vol 4, #5 October
    2005
-   *Five Things We Need to Know About Technological Change* by Neil Postman,
    Lecture Given in March 1998


## Week 2

**<span class="underline">Subject: A Secular Framing of Ethical Technology</span>**

<div class="mdframed" id="org03fb28c">
<p>
<i>&ldquo;Do not love the world or anything in the world. If anyone loves the world,
love for the Father is not in them. For everything in the world—the lust
of the flesh, the lust of the eyes, and the pride of life—comes not from the
Father but from the world. The world and its desires pass away, but whoever
does the will of God lives forever.&rdquo;</i> 1 John 2:15-17
</p>

</div>


### Readings

-   *Ethics in the Age of Disruptive Technology, Appendix 1/2 - Examples of
    Technology Ethics and Responsible Technology Practices & ITEC Principles and
    How to Use Them: Anchoring, Guiding, Specifying, Action* by Intstitute for
    Technology, Ethics, and Culture
-   *Ethics in Technology Practice* by Shannon Vallorm, Iring Raicu, and Brian
    Green. The Markkula Center for Applied Ethics at Santa Clara University
-   *Code of Ethics for Engineers* National Society of Professional Engineers


## Week 3

**<span class="underline">Subject: A Christian Framing of Ethical Technology</span>**

<div class="mdframed" id="org63323f4">
<p>
<i>&ldquo;Do not conform to the pattern of this world, but be transformed by the
renewing of your mind. Then you will be able to test and approve what God’s will
is—his good, pleasing and perfect will.&rdquo;</i> Romans 12:2 
<i>&ldquo;Your hands made me and formed me; give me understanding to
learn your commands.&rdquo;</i> Psalm 119:73
</p>

</div>


### Readings

-   *The Computer Scientist as Toolsmith II* by Fred Brooks, Communications with
    the ACM, March 1996
-   *A Christian Field Guide to Technology for Engineers and Designers*, Chapters
    5 & 6, by Ethan Brue, Derek Schuurman, and Steven Vanderleest


## Week 4

**<span class="underline">Subject: Putting it Into Practice</span>**

<div class="mdframed" id="orgb135e8b">
<p>
<i>&ldquo;Whatever you do, work at it with all your heart, as working for the Lord, not
for human masters, since you know that you will receive an inheritance from the
Lord as a reward. It is the Lord Christ you are serving.&rdquo;</i> Colossians 3:23-24
</p>

</div>


### Readings

-   *A Christian Field Guide to Technology for Engineers and Designers*, Chapter
    9, by Ethan Brue, Derek Schuurman, and Steven Vanderleest


# Week 1


## Readings


## Discussion Topics

